---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
source: html/3a7635ed-8657-446b-72ac-cefa071f3e01.htm
---
# AssetPropertyDoubleArray4d Methods

Adds a new connected asset attached to this asset property, if it allows it.